# Importing libraries

In [1]:
import pandas as pd
import numpy as np
import os

# Importing data

In [2]:
path = r'/Users/seyda/Documents/Instacard Basket Analysis'

In [4]:
df_customer = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))

In [5]:
df_customer.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

# Renaming Columns

In [6]:
df_customer.rename(columns = {'First Name':'first_name'}, inplace = True)

In [15]:
df_customer.rename(columns = {'Surnam':'last_name'}, inplace = True)

In [8]:
df_customer.rename(columns = {'Gender': 'gender'}, inplace = True)

In [9]:
df_customer.rename(columns = {'STATE':'state'}, inplace = True)

In [11]:
df_customer.rename(columns = {'Age':'age'}, inplace = True)

In [12]:
df_customer.rename(columns = {'n_dependants':'number_of_dependants'}, inplace =True)

In [13]:
df_customer.rename(columns = {'fam_status': 'marital_status'}, inplace = True)

In [16]:
df_customer.head(5)

,user_id,first_name,last_name,gender,state,age,date_joined,number_of_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [17]:
df_customer.shape

(206209, 10)

# Consistency Check

In [33]:
# check the data types
df_customer.dtypes

user_id                  int64
first_name              object
last_name               object
gender                  object
state                   object
age                      int64
date_joined             object
number_of_dependants     int64
marital_status          object
income                   int64
dtype: object

In [22]:
# check for mixed type variables
for col in df_customer.columns.tolist():
    weird = (df_customer[[col]]. applymap(type) != df_customer[[col]].iloc[0].apply(type)).any(axis=1)
    if len(df_customer[weird])>0:
        print (col)

first_name

In [24]:
# change the data type of the 'first_name' column
df_customer['first_name'] = df_customer['first_name']. astype ('str')

In [25]:
# check the missing values
df_customer.isnull().sum()

user_id                 0
first_name              0
last_name               0
gender                  0
state                   0
age                     0
date_joined             0
number_of_dependants    0
marital_status          0
income                  0
dtype: int64

There isn't any missing values

In [32]:
# check the duplicates
df_customer[df_customer.duplicated()]

Empty DataFrame
Columns: [user_id, first_name, last_name, gender, state, age, date_joined, number_of_dependants, marital_status, income]
Index: []

# Combine the data with the order_product data

In [35]:
# Import the prepared data
ords_prods_merged_new = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_merged_flags.pkl'))

In [37]:
# Check the data types and columns
ords_prods_merged_new.dtypes

order_id                     int64
user_id                      int64
order_number                 int64
customer_id                  int64
order_day_of_week            int64
order_hour_of_day            int64
days_since_prior_order     float64
product_id                   int64
add_to_cart_order            int64
reordered                    int64
_merge                    category
product_name                object
aisle_id                     int64
department_id                int64
prices                     float64
price_range_loc             object
busiest_day                 object
busiest_days                object
busiest_period_of_day       object
max_order                    int64
loyalty_flag                object
avg_price                  float64
spender_flag                object
median_order_frequency     float64
customer_behavior           object
dtype: object

In [38]:
df_customer.dtypes

user_id                  int64
first_name              object
last_name               object
gender                  object
state                   object
age                      int64
date_joined             object
number_of_dependants     int64
marital_status          object
income                   int64
dtype: object

'user_id' column is the common column to merge these 2 data.

In [39]:
df_merged = ords_prods_merged_new.merge(df_customer, on = ['user_id'])

In [40]:
df_merged.head()

,order_id,user_id,order_number,customer_id,order_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,...,customer_behavior,first_name,last_name,gender,state,age,date_joined,number_of_dependants,marital_status,income
0,2539329,1,1,1,2,8,0.0,196,1,0,...,Regular customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
1,2398795,1,2,1,3,7,15.0,196,1,1,...,Regular customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
2,473747,1,3,1,3,12,21.0,196,1,1,...,Regular customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
3,2254736,1,4,1,4,7,29.0,196,1,1,...,Regular customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
4,431534,1,5,1,4,15,28.0,196,1,1,...,Regular customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423

I've reliazed that there 2 exact columns with different names which are 'user_id' and 'customer_id'. I've decided to drop customer_id column.

In [41]:
df_merged_new = df_merged.drop(columns = ['customer_id'])

In [42]:
df_merged_new.head()

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge,...,customer_behavior,first_name,last_name,gender,state,age,date_joined,number_of_dependants,marital_status,income
0,2539329,1,1,2,8,0.0,196,1,0,both,...,Regular customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
1,2398795,1,2,3,7,15.0,196,1,1,both,...,Regular customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
2,473747,1,3,3,12,21.0,196,1,1,both,...,Regular customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
3,2254736,1,4,4,7,29.0,196,1,1,both,...,Regular customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
4,431534,1,5,4,15,28.0,196,1,1,both,...,Regular customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423

# Export the new data

In [43]:
df_merged_new.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'customer_orders_products_merged.pkl'))